test_R/results_144_apache/apache_performance_00134/mn.mp.input.vdu01.0/tngbench_share/cmd_start.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 20.0.0.254 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        Apache/2.4.18
Server Hostname:        20.0.0.254
Server Port:            80

Document Path:          /
Document Length:        13 bytes

Concurrency Level:      100
Time taken for tests:   2.472 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1800000 bytes
HTML transferred:       130000 bytes
Requests per second:    4044.56 [#/sec] (mean)
Time per request:       24.725 [ms] (mean)
Time per request:       0.247 [ms] (mean, across all concurrent requests)
Transfer rate:          710.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       7
Processing:     3   24   1.3     24      33
Waiting:        3   24   1.3     24      33
Total:          8   25   1.1     24      37

Percentage of the requests served within a certain time (ms)
  50%     24
  66%     24
  75%     24
  80%     25
  90%     25
  95%     25
  98%     27
  99%     28
 100%     37 (longest request)